IRAN_PROVINCES = {
    "آذربایجان شرقی": ["تبریز", "مراغه", "میانه", "مرند", "آذرشهر", "اسکو", "عجب‌شیر", "بناب", "خسروشاه", "سراب", "ملکان", "هریس", "هشترود", "بستان‌آباد"],

    "آذربایجان غربی": ["ارومیه", "خوی", "ماکو", "بوکان", "سلماس", "پیرانشهر", "میاندوآب", "شاهین‌دژ", "تکاب", "نقده", "چالدران", "سردشت", "ماهنشان"],

    "اردبیل": ["اردبیل", "مشگین‌شهر", "خلخال", "کوثر", "بیله‌سوار", "گرمی", "نمین", "پارس‌آباد"],

    "اصفهان": ["اصفهان", "کاشان", "نجف‌آباد", "خمینی‌شهر", "فریدن", "برخوار", "لنجان", "شاهین‌شهر", "نطنز", "فلاورجان", "سمیرم", "خوانسار", "دولت‌آباد"],

    "البرز": [
        "کرج", "فردیس", "ماهدشت", "محمدشهر", "کمال‌شهر", "هشتگرد", "چهارباغ",
        "نظرآباد", "اشتهارد", "طالقان", "گرمدره"
    ],

    "ایلام": ["ایلام", "دهلران", "آبدانان", "ایوان", "مهران", "بدره", "دره‌شهر", "شیروان‌چرداول"],

    "بوشهر": ["بوشهر", "دشتستان", "گناوه", "دیلم", "دیر", "کنگان", "جم", "تنگستان", "عسلویه"],

    "تهران": [
        "تهران", "ری", "اسلامشهر", "شهریار", "قدس", "ملارد", "رباط‌کریم", "پرند",
        "باقرشهر", "نسیم‌شهر", "پاکدشت", "ورامین", "قرچک", "پیشوا",
        "دماوند", "رودهن", "آبعلی", "بومهن", "پردیس", "شمیرانات", "فشم", "لواسان", "اندیشه"
    ],

    "چهارمحال و بختیاری": ["شهرکرد", "لردگان", "فارسان", "کوهرنگ", "کیار", "بن", "سامان"],

    "خراسان جنوبی": ["بیرجند", "قاین", "نهبندان", "درمیان", "سربیشه", "زیرکوه", "طبس"],

    "خراسان رضوی": ["مشهد", "نیشابور", "سبزوار", "تربت جام", "قوچان", "تربت حیدریه", "چناران", "خواف", "گناباد", "درگز", "فریمان"],

    "خراسان شمالی": ["بجنورد", "شیروان", "اسفراین", "جاجرم", "گرمه", "مانه و سملقان"],

    "خوزستان": ["اهواز", "دزفول", "آبادان", "ماهشهر", "شادگان", "بهبهان", "مسجدسلیمان", "رامهرمز", "خرمشهر", "شوشتر", "اندیمشک"],

    "زنجان": ["زنجان", "ابهر", "خرمدره", "ماه‌نشان", "ایجرود", "طارم"],

    "سمنان": ["سمنان", "شاهرود", "دامغان", "گرمسار", "مهدی‌شهر", "سرخه"],

    "سیستان و بلوچستان": ["زاهدان", "زابل", "چابهار", "نیک‌شهر", "ایرانشهر", "کنارک", "خاش", "سرباز", "میرجاوه"],

    "فارس": ["شیراز", "کازرون", "مرودشت", "فیروزآباد", "فسا", "لامرد", "جهرم", "اقلید", "مرکز ممسنی", "استهبان"],

    "قزوین": ["قزوین", "بوئین‌زهرا", "آبیک", "البرز"],

    "قم": ["قم"],

    "کردستان": ["سنندج", "بانه", "قروه", "سقز", "دیواندره", "کامیاران", "مریوان"],

    "کرمان": ["کرمان", "رفسنجان", "سیرجان", "بافت", "بردسیر", "راور", "جیرفت", "زرند", "کوهبنان", "منوجان", "رابر"],

    "کرمانشاه": ["کرمانشاه", "صحنه", "هرسین", "پاوه", "سرپل ذهاب", "قصر شیرین", "کنگاور", "گیلانغرب"],

    "کهگیلویه و بویراحمد": ["یاسوج", "دوگنبدان", "دهدشت", "چرام"],

    "گلستان": ["گرگان", "گنبد کاووس", "آق‌قلا", "علی‌آباد", "کلاله", "بندرترکمن", "رامیان", "مینودشت"],

    "گیلان": ["رشت", "آستانه اشرفیه", "لاهیجان", "تالش", "صومعه‌سرا", "رضوان‌شهر", "انزلی"],

    "لرستان": ["خرم‌آباد", "دورود", "کوهدشت", "الیگودرز", "بروجرد"],

    "مازندران": ["ساری", "آمل", "بابلسر", "چالوس", "تنکابن", "نوشهر", "قائم‌شهر", "رامسر"],

    "مرکزی": ["اراک", "خمین", "دلیجان", "شازند", "ساوه"],

    "هرمزگان": ["بندرعباس", "قشم", "میناب", "بندرلنگه", "ابوموسی"],

    "همدان": ["همدان", "نهاوند", "ملایر", "کبودرآهنگ", "اسدآباد"],

    "یزد": ["یزد", "میبد", "اردکان", "مهریز", "تفت"]
}
